app/controllers/questions_controller.rb

  def show
    @question = Question.find params[:id]
    @answer = @question.answers.build
    @answers = @question.answers.order(created_at: :desc).page(params[:page]).per(5)
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."created_at" DESC  [["question_id", 60]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 67]]

  def destroy
    @question = Question.find params[:id]
    @question.destroy
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 56]]

  def edit
    @question = Question.find params[:id]
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]

  def update
    @question = Question.find params[:id]
     if @question.update question_params
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
UPDATE "questions" SET "body" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["body", "xcxcxcz000"], ["updated_at", "2022-01-19 16:43:44.002609"], ["id", 68]]

  def index
    @questions = Question.order(created_at: :desc).page params[:page]
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "questions" ORDER BY "questions"."created_at" DESC LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 25], ["OFFSET", 25]]

  def create
    @question = Question.new question_params
    if @question.save
---
INSERT INTO "questions" ("title", "string", "body", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "question 1"], ["string", nil], ["body", "defsdfsfsf"], ["text", nil], ["created_at", "2022-01-15 18:52:13.221887"], ["updated_at", "2022-01-15 18:52:13.221887"]]