app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "Dan0@mail.ru"], ["name", "DanDan"], ["password_digest", "[FILTERED]"], ["created_at", "2022-01-20 19:07:54.463134"], ["updated_at", "2022-01-20 19:07:54.463134"]]
---
  def create
    @user = User.new user_params
    if @user.save